windsorschmidt/st-f469i-disco-cube/st-f469i-disco-cube.ioc
#MicroXplorer Configuration settings - do not modify
PF7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PF5.GPIO_PuPd=GPIO_NOPULL
SH.FMC_D0_DA0.ConfNb=1
PI7.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_A8.ConfNb=1
SH.FMC_A0.ConfNb=1
SH.FMC_D6_DA6.ConfNb=1
PC10.GPIO_PuPd=GPIO_NOPULL
SH.FMC_D9_DA9.ConfNb=1
FMC.SDClockPeriod1=FMC_SDRAM_CLOCK_PERIOD_2
SH.FMC_A0.0=FMC_A0,12b-sda1
PE11.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PB10.GPIO_PuPd=GPIO_PULLUP
PH15.GPIO_Label=D23
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PA10.GPIO_PuPd=GPIO_NOPULL
PG8.Signal=FMC_SDCLK
PG8.Locked=true
DSIHOST_D0N.Mode=DSIHost_Video
PG0.Locked=true
RCC.PLLQCLKFreq_Value=60000000
PG0.Signal=FMC_A10
PA3.GPIO_PuPd=GPIO_NOPULL
PD8.Locked=true
RCC.RTCFreq_Value=32000
RCC.PLLDSIFreq_Value=500000000
PE8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PE10.GPIO_PuPd=GPIO_NOPULL
PD10.GPIO_PuPd=GPIO_NOPULL
PD0.Locked=true
PD2.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_SDNWE.ConfNb=1
PG14.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.FMC_D5_DA5.0=FMC_D5,sd-32b-d1
PF10.GPIO_PuPd=GPIO_NOPULL
PJ2.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PG2.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PI10.GPIO_PuPd=GPIO_NOPULL
PH10.GPIO_PuPd=GPIO_NOPULL
PH13.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D9_DA9.0=FMC_D9,sd-32b-d1
SH.GPXTI7.ConfNb=1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PD0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
DSIHOST_D0P.Signal=DSIHOST_D0P
SH.FMC_D25.0=FMC_D25,sd-32b-d1
PE13.GPIO_Mode=GPIO_MODE_AF_PP
PF13.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_NBL2.ConfNb=1
PG15.GPIO_Label=SDNCAS [MT48LC4M32B2B5-6A_CAS]
DSIHOST_D0P.Locked=true
PF7.Signal=QUADSPI_BK1_IO2
NVIC.DMA2D_IRQn=true\:0\:0\:false\:false\:true\:true\:true
SH.FMC_SDNWE.0=FMC_SDNWE,12b-sda1
PH9.Signal=FMC_D17
PG7.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D11_DA11.0=FMC_D11,sd-32b-d1
PD9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
RCC.APB2TimFreq_Value=180000000
PB6.Signal=QUADSPI_BK1_NCS
PD0.Signal=FMC_D2_DA2
PD8.Signal=FMC_D13_DA13
PE1.Signal=FMC_NBL1
PI5.GPIO_Mode=GPIO_MODE_AF_PP
PE14.Locked=true
RCC.PLLSAIRCLKFreq_Value=108000000
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF1.GPIO_Label=A1
PI4.GPIO_Label=FMC_NBL2 [MT48LC4M32B2B5-6A_DQM2]
PD1.GPIO_Label=D3
FMC.SelfRefreshTime1=4
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.0
PF12.GPIO_Label=A6
PI7.Locked=true
LTDC.IPParameters=Layers,PixelFormat_L0,ActiveW
LTDC.PixelFormat_L0=LTDC_PIXEL_FORMAT_RGB888
ProjectManager.BackupPrevious=false
PE9.Signal=FMC_D6_DA6
PI2.Locked=true
DSIHOST_D1N.Signal=DSIHOST_D1N
SH.FMC_A2.0=FMC_A2,12b-sda1
PE9.Locked=true
PE4.GPIO_Label=SAI1_FSA [CS43L22_LRCK]
PF10.Locked=true
PF13.Locked=true
PD14.GPIO_PuPd=GPIO_NOPULL
PF2.Locked=true
RCC.PLLRCLKFreq_Value=180000000
PE1.Locked=true
SH.FMC_D1_DA1.0=FMC_D1,sd-32b-d1
PB6.Locked=true
PK3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PC15/OSC32_OUT.Locked=true
PH14.GPIO_PuPd=GPIO_NOPULL
PF1.GPIO_Mode=GPIO_MODE_AF_PP
PF14.GPIO_PuPd=GPIO_NOPULL
PG0.GPIO_PuPd=GPIO_NOPULL
PH3.GPIO_PuPd=GPIO_NOPULL
ProjectManager.HalAssertFull=false
PI2.GPIO_PuPd=GPIO_NOPULL
PE9.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.Package=TFBGA216
PB9.Signal=I2C1_SDA
NVIC.TimeBase=TIM6_DAC_IRQn
PI9.GPIO_Mode=GPIO_MODE_AF_PP
PI2.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_SDNCAS.ConfNb=1
SH.FMC_A11.ConfNb=1
NVIC.TimeBaseIP=TIM6
PA10.Signal=USB_OTG_FS_ID
SH.FMC_D27.0=FMC_D27,sd-32b-d1
PE12.GPIO_Label=D9
FMC.WriteRecoveryTime1=3
PF7.Locked=true
PH9.Locked=true
RCC.APB2CLKDivider=RCC_HCLK_DIV2
PH3.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
RCC.APB1TimFreq_Value=90000000
PD5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PH5.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB0.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
FMC.RowCycleDelay1=7
DSIHOST_D1P.GPIO_Label=DSI_D1_P
PF9.GPIO_PuPd=GPIO_NOPULL
PD5.Locked=true
PD15.Signal=FMC_D1_DA1
RCC.PLLSAIQCLKFreq_Value=108000000
SH.FMC_D3_DA3.ConfNb=1
PE7.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC8.GPIO_Mode=GPIO_MODE_AF_PP
PI5.GPIO_PuPd=GPIO_NOPULL
PD6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin80=PF12
Mcu.Pin81=PG1
SH.FMC_A4.0=FMC_A4,12b-sda1
ProjectManager.ProjectFileName=st-f469i-disco-cube.ioc
SH.FMC_A5.ConfNb=1
PH10.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PH13.Locked=true
PH13.Signal=FMC_D21
Mcu.Pin79=PB2/BOOT1
PI10.Locked=true
Mcu.PinsNb=117
PC11.Locked=true
PI3.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin73=PF9
Mcu.Pin74=PF8
PD1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF4.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.Pin71=PD10
Mcu.Pin72=PF10
Mcu.Pin77=PD8
PG5.Locked=true
Mcu.Pin78=PC0
PG5.Signal=FMC_A15_BA1
Mcu.Pin75=PD14
Mcu.Pin76=PD9
PE9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D10_DA10.0=FMC_D10,sd-32b-d1
PB6.GPIO_PuPd=GPIO_NOPULL
PI6.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin70=PD15
SH.FMC_D16.0=FMC_D16,sd-32b-d1
Mcu.Pin68=PF5
Mcu.Pin69=PH2
Mcu.Pin62=DSIHOST_D0P
PG14.Locked=true
Mcu.Pin63=DSIHOST_D0N
Mcu.Pin60=PH5
PF5.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.Pin61=PH3
Mcu.Pin66=PF7
Mcu.Pin67=PF6
Mcu.Pin64=PG7
Mcu.Pin65=PG6
PG8.GPIO_PuPd=GPIO_NOPULL
PF8.GPIO_Label=QSPI_BK1_IO0 [N25Q128A13EF840F_DQ0]
PD10.Signal=FMC_D15_DA15
PB8.GPIO_Label=I2C1_SCL
PC10.GPIO_Mode=GPIO_MODE_AF_PP
PB10.GPIO_Mode=GPIO_MODE_AF_PP
PE15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D29.0=FMC_D29,sd-32b-d1
Mcu.Pin59=PF4
Mcu.Pin57=DSIHOST_CKN
Mcu.Pin58=PG8
PH11.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PH4.Locked=true
Mcu.Pin51=PF2
Mcu.Pin52=PC8
Mcu.Pin50=PH0/OSC_IN
RCC.PLLDSIVCOFreq_Value=1000000000
Mcu.Pin55=PH4
Mcu.Pin56=DSIHOST_CKP
Mcu.Pin53=PH1/OSC_OUT
Mcu.Pin54=PF3
PE8.GPIO_Label=D5
PH11.GPIO_Label=D19
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
PB9.Locked=true
PB11.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PF5.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PI3.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin48=DSIHOST_D1N
Mcu.Pin49=PC9
PH13.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin46=PC15/OSC32_OUT
Mcu.Pin47=DSIHOST_D1P
PF3.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PG6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE2.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin40=PF1
Mcu.Pin41=PI9
PI0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PE13.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin44=PI0
Mcu.Pin45=PA9
Mcu.Pin42=PH13
Mcu.Pin43=PH14
PF10.GPIO_Mode=GPIO_MODE_AF_PP
VP_LTDC_DSIMode.Signal=LTDC_DSIMode
PE1.GPIO_Label=FMC_NBL1 [ MT48LC4M32B2B5-6A_DQM1]
PD14.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF13.GPIO_PuPd=GPIO_NOPULL
PI7.Signal=FMC_D29
FMC.ReadBurst1=FMC_SDRAM_RBURST_ENABLE
SH.FMC_A6.0=FMC_A6,12b-sda1
PE14.Signal=FMC_D11_DA11
Mcu.Pin37=PI1
Mcu.Pin38=PA10
Mcu.Pin35=PD2
Mcu.Pin36=PH15
PD4.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PH4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D14_DA14.ConfNb=1
Mcu.Pin39=PC14/OSC32_IN
PG7.GPIO_Label=SAI1_MCLKA [CS43L22_MCLK]
PI2.Signal=FMC_D26
PF4.GPIO_Label=A4
Mcu.Pin30=PI10
Mcu.Pin33=PG9
PC9.GPIO_PuPd=GPIO_NOPULL
DSIHOST_CKN.GPIOParameters=GPIO_Label
Mcu.Pin34=PD4
PE3.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin31=PI6
Mcu.Pin32=PK3
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF13.Signal=FMC_A7
PC10.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PG14.GPIO_PuPd=GPIO_NOPULL
SH.FMC_NBL2.0=FMC_NBL2,Sd4ByteEnable1
PC9.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
RCC.PLLI2SQCLKFreq_Value=48000000
PI9.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin26=PA11
SH.FMC_D18.0=FMC_D18,sd-32b-d1
Mcu.Pin27=PF0
SH.FMC_D21.ConfNb=1
Mcu.Pin24=PI3
Mcu.Pin25=PI2
Mcu.Pin28=PI5
Mcu.Pin29=PI7
PC8.GPIO_PuPd=GPIO_NOPULL
PD14.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin22=PD5
Mcu.Pin23=PD1
Mcu.Pin20=PA12
Mcu.Pin21=PI4
PA3.Locked=true
PD10.Locked=true
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
PA14.GPIOParameters=GPIO_Label
PC14/OSC32_IN.Locked=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE5.GPIO_Label=SAI1_SCKA [CS43L22_CLK]
PC12.GPIO_Label=uSD_CLK
PD15.Locked=true
SH.FMC_SDNRAS.ConfNb=1
ProjectManager.HeapSize=0x200
Mcu.Pin15=PG15
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
DSIHOST_CKP.GPIO_Label=DSI_CK_P
Mcu.Pin16=PD6
Mcu.Pin13=PB7
PD0.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin14=PB6
Mcu.Pin19=PC10
PF10.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin17=PD0
Mcu.Pin18=PC11
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PE5
Mcu.Pin12=PB9
PD0.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF0.GPIO_Label=A0
PI1.GPIO_Mode=GPIO_MODE_AF_PP
PG0.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PH14.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.Pin10=PA13
PE3.Signal=GPIO_Output
PC15/OSC32_OUT.Signal=RCC_OSC32_OUT
PF4.Signal=FMC_A4
SH.FMC_D26.ConfNb=1
DSIHOST_D0P.GPIO_Label=DSI_D0_P
PD2.Signal=SDIO_CMD
PD14.GPIO_Mode=GPIO_MODE_AF_PP
PH9.GPIO_Mode=GPIO_MODE_AF_PP
PG15.Locked=true
PI1.GPIO_Label=D25
DSIHOST.LPVerticalSyncActiveEnable=DSI_LP_VSYNC_ENABLE
Mcu.Family=STM32F4
FMC.IPParameters=CASLatency1,SDClockPeriod1,ReadBurst1,LoadToActiveDelay1,ExitSelfRefreshDelay1,SelfRefreshTime1,RowCycleDelay1,WriteRecoveryTime1,RPDelay1,RCDDelay1
ProjectManager.MainLocation=Src
SH.FMC_A6.ConfNb=1
PK3.Signal=GPIO_Output
SH.FMC_A8.0=FMC_A8,12b-sda1
PI4.GPIO_Mode=GPIO_MODE_AF_PP
PG9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
RCC.PLLDSIIDF=DSI_PLL_IN_DIV2
ProjectManager.KeepUserCode=true
PH14.Signal=FMC_D22
PH10.Signal=FMC_D18
SH.FMC_D14_DA14.0=FMC_D14,sd-32b-d1
PG2.Signal=GPIO_Input
PE11.GPIO_Label=D8
PG2.Locked=true
PF0.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PA12.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE2.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PA11.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD0.GPIO_Label=D2
PH10.Locked=true
PD6.Locked=true
PF9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB2/BOOT1.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PC14/OSC32_IN.Mode=LSE-External-Oscillator
PD2.GPIO_Mode=GPIO_MODE_AF_PP
PD2.Locked=true
SH.FMC_A14_BA0.0=FMC_BA0,FourSdramBanks1
SH.FMC_A11.0=FMC_A11,12b-sda1
PG9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PJ2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB7.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_RISING
PD8.GPIO_PuPd=GPIO_NOPULL
PF12.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PI9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PG15.Signal=FMC_SDNCAS
PH5.GPIOParameters=GPIO_Speed,GPIO_PuPdOD,GPIO_Label,GPIO_Mode
PJ5.GPIO_Label=LCD_INT
PH11.GPIO_PuPd=GPIO_NOPULL
PD13.Signal=S_TIM4_CH2
Mcu.IP4=I2C2
Mcu.IP5=LTDC
RCC.FCLKCortexFreq_Value=180000000
PD13.Locked=true
Mcu.IP2=FMC
Mcu.IP3=I2C1
PC11.GPIO_PuPd=GPIO_NOPULL
Mcu.IP0=DMA2D
Mcu.IP1=DSIHOST
PE4.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PJ2.Signal=DSIHOST_TE
PF9.Locked=true
PH3.Locked=true
PF1.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PE11.GPIO_PuPd=GPIO_NOPULL
PF11.GPIO_PuPd=GPIO_NOPULL
RCC.SDIOFreq_Value=36000000
ProjectManager.PreviousToolchain=
PF1.Locked=true
PG15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PG8.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_NBL1.0=FMC_NBL1,Sd4ByteEnable1
PF15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PA9.GPIO_Mode=GPIO_MODE_AF_PP
RCC.HSE_VALUE=8000000
PI2.GPIO_Mode=GPIO_MODE_AF_PP
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.FMC_A14_BA0.ConfNb=1
PE2.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
FMC.ExitSelfRefreshDelay1=7
PF7.GPIO_Mode=GPIO_MODE_AF_PP
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:false\:false\:false
PE13.GPIO_PuPd=GPIO_NOPULL
PB3.GPIO_PuPd=GPIO_NOPULL
PF7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PI4.Locked=true
RCC.VCOInputFreq_Value=1000000
DSIHOST.LPHorizontalFrontPorchEnable=DSI_LP_HFP_ENABLE
PF8.GPIO_PuPd=GPIO_NOPULL
PA14.Mode=Serial_Wire
PE8.Locked=true
DSIHOST_D1P.Signal=DSIHOST_D1P
PB2/BOOT1.GPIO_PuPd=GPIO_NOPULL
PF11.Signal=FMC_SDNRAS
PC11.GPIO_Label=uSD_D3
PE3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PK3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PB7.Signal=GPXTI7
PE3.Locked=true
PG7.GPIO_PuPd=GPIO_NOPULL
PF11.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PH12.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D27.ConfNb=1
PB6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PJ5.GPIO_PuPd=GPIO_NOPULL
PB0.Locked=true
PA13.GPIOParameters=GPIO_Label
PG6.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
SH.FMC_D16.ConfNb=1
PB7.GPIO_Label=OTG_FS1_OverCurrent [STMPS2151STR_FAULT]
PD6.GPIO_Mode=GPIO_MODE_AF_PP
PD13.GPIO_Label=MIC_CK [MP34DT01TR_CLK]
DSIHOST.IPParameters=NumberOfLanes,StopWaitTime,LPHorizontalFrontPorchEnable,LPHorizontalBackPorchEnable,LPVerticalActiveEnable,LPVerticalFrontPorchEnable,LPVerticalBackPorchEnable,LPVerticalSyncActiveEnable
PD5.GPIO_Label=LED3 [Red]
SH.FMC_D4_DA4.ConfNb=1
ProjectManager.ToolChainLocation=
PG1.GPIO_PuPd=GPIO_NOPULL
RCC.DSIFreq_Value=62500000
PF8.Signal=QUADSPI_BK1_IO0
PG0.GPIO_Label=A10
SH.FMC_D30.ConfNb=1
PI0.GPIO_Label=D24
PA10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin95=PH11
Mcu.Pin96=PF14
PF4.Locked=true
Mcu.Pin93=PH7
Mcu.Pin94=PH9
PH11.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin99=PE9
Mcu.Pin97=PJ2
Mcu.Pin98=PF11
PD0.GPIO_Mode=GPIO_MODE_AF_PP
DSIHOST_CKN.Signal=DSIHOST_CKN
PG14.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.Pin91=PG5
Mcu.Pin92=PG4
Mcu.Pin90=PE8
PE14.GPIO_Mode=GPIO_MODE_AF_PP
PH2.Mode=SdramChipSelect1_1
PE7.Signal=FMC_D4_DA4
PD6.Signal=SAI1_SD_A
PF3.GPIO_Label=A3
SH.FMC_D22.ConfNb=1
PF15.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PE2.GPIO_Label=AUDIO_RST [CS43L22_RESET]
PH15.GPIO_PuPd=GPIO_NOPULL
PE12.Locked=true
PA12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
DSIHOST_D0P.Mode=DSIHost_Video
Mcu.Pin84=PG2
Mcu.Pin85=PJ5
Mcu.Pin82=PF15
Mcu.Pin83=PD13
PG2.GPIO_Label=uSD_Detect
Mcu.Pin88=PF13
PA3.Signal=GPIO_Output
Mcu.Pin89=PG0
Mcu.Pin86=PH12
Mcu.Pin87=PA0/WKUP
PE0.GPIO_PuPd=GPIO_NOPULL
SH.FMC_A3.ConfNb=1
PG1.GPIO_Mode=GPIO_MODE_AF_PP
RCC.I2SFreq_Value=96000000
SH.FMC_D20.0=FMC_D20,sd-32b-d1
PH8.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PH15.Locked=true
PC0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PB8.GPIOParameters=GPIO_Speed,GPIO_PuPdOD,GPIO_Label,GPIO_Mode
PG7.Locked=true
PD15.GPIO_Label=D1
PG7.Signal=SAI1_MCLK_A
PD13.GPIO_ModeDefaultPP=GPIO_MODE_AF_PP
PE14.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PH12.GPIO_Label=D20
PC9.GPIO_Label=uSD_D1
PC11.Signal=SDIO_D3
PC8.Signal=SDIO_D0
PF10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D31.0=FMC_D31,sd-32b-d1
PH4.GPIO_PuPdOD=GPIO_PULLUP
PJ2.GPIO_PuPd=GPIO_NOPULL
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=D11
PD9.Signal=FMC_D14_DA14
PD8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
ProjectManager.DeletePrevious=true
PB10.Locked=true
boardIOC=true
PA9.GPIO_PuPd=GPIO_NOPULL
DSIHOST_CKP.GPIOParameters=GPIO_Label
PA12.GPIO_Label=USB_FS1_P
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
DSIHOST_CKN.Locked=true
PB9.GPIOParameters=GPIO_Speed,GPIO_PuPdOD,GPIO_Label,GPIO_Mode
PD8.GPIO_Label=D13
PE15.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PB0.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PG8.GPIO_Label=SDCLK [MT48LC4M32B2B5-6A_CLK]
PA13.Signal=SYS_JTMS-SWDIO
DSIHOST.LPHorizontalBackPorchEnable=DSI_LP_HBP_ENABLE
PD4.GPIO_PuPd=GPIO_NOPULL
PJ5.Locked=true
SH.FMC_A15_BA1.ConfNb=1
PB2/BOOT1.Signal=GPIO_Output
PF6.Signal=QUADSPI_BK1_IO3
PH8.Locked=true
PC9.GPIO_Mode=GPIO_MODE_AF_PP
PB10.GPIO_Label=STLK_RX [STLINK V2-1_U2_RX]
PF6.Locked=true
SH.FMC_D13_DA13.0=FMC_D13,sd-32b-d1
PF0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PH8.Signal=FMC_D16
PB7.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PB9.Mode=I2C
PG2.GPIO_Mode=GPIO_MODE_INPUT
PE2.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE0.Locked=true
RCC.USBFreq_Value=36000000
PI5.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF9.GPIO_Label=QSPI_BK1_IO1 [N25Q128A13EF840F_DQ1]
SH.FMC_D24.ConfNb=1
PD10.GPIO_Label=D15
PE10.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
RCC.VCOI2SOutputFreq_Value=192000000
PH10.GPIO_Mode=GPIO_MODE_AF_PP
PH9.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
DSIHOST_CKP.Signal=DSIHOST_CKP
PE10.GPIO_Mode=GPIO_MODE_AF_PP
RCC.PLLSAIPCLKFreq_Value=36000000
board=STM32F469I-DISCO
PD13.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.VCOOutputFreq_Value=360000000
PF14.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PI9.Signal=FMC_D30
PH4.GPIO_Label=I2C2_SCL [CS43L22_SCL]
SH.FMC_D22.0=FMC_D22,sd-32b-d1
PI9.Locked=true
PH13.GPIO_PuPd=GPIO_NOPULL
MxCube.Version=5.6.0
DSIHOST_D1N.Locked=true
RCC.PLLDSINDIV=125
PI4.Signal=FMC_NBL2
PD4.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PA10.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE11.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D12_DA12.0=FMC_D12,sd-32b-d1
PF15.GPIO_Label=A9
PD5.GPIO_PuPd=GPIO_NOPULL
SH.FMC_D29.ConfNb=1
PF14.Locked=true
PE5.Locked=true
PE14.GPIO_PuPd=GPIO_NOPULL
SH.FMC_D18.ConfNb=1
PF1.Signal=FMC_A1
SH.FMC_D11_DA11.ConfNb=1
PF8.GPIO_Mode=GPIO_MODE_AF_PP
