windsorschmidt/st-f469i-disco-cube/st-f469i-disco-cube.ioc
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DSIFreq_Value,DSITXEscFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,I2SFreq_Value,LCDTFTFreq_Value,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLDSIFreq_Value,PLLDSIIDF,PLLDSINDIV,PLLDSIVCOFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLRCLKFreq_Value,PLLRFreq_Value,PLLSAIN,PLLSAIP,PLLSAIPCLKFreq_Value,PLLSAIQ,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSourceVirtual,RTCFreq_Value,RTCHSEDivFreq_Value,SAIAFreq_Value,SAIBFreq_Value,SDIOFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USBCLockSelection,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
ProjectManager.AskForMigrate=true
PE0.Signal=FMC_NBL0
PE7.GPIO_Label=D4
PE12.Signal=FMC_D9_DA9
PE12.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.IP8=SYS
Mcu.IP9=TIM1
PI1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.IP6=NVIC
Mcu.IP7=RCC
ProjectManager.CoupleFile=false
DSIHOST_CKN.GPIO_Label=DSI_CK_N
RCC.SYSCLKFreq_VALUE=180000000
PI9.GPIO_PuPd=GPIO_NOPULL
PI10.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PI7.GPIO_Mode=GPIO_MODE_AF_PP
KeepUserPlacement=false
PA13.Locked=true
PJ5.Signal=GPXTI5
DSIHOST.LPVerticalBackPorchEnable=DSI_LP_VBP_ENABLE
PE15.GPIO_PuPd=GPIO_NOPULL
PF13.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PI6.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF9.GPIO_Mode=GPIO_MODE_AF_PP
RCC.PLLQ=6
PI6.GPIO_Mode=GPIO_MODE_AF_PP
PI3.GPIO_Label=D27
PH3.Signal=FMC_SDNE0
RCC.PLLM=8
RCC.PLLN=360
PB2/BOOT1.Locked=true
DSIHOST.StopWaitTime=10
PE5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB7.Locked=true
PA9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PH12.GPIO_PuPd=GPIO_NOPULL
PC8.Locked=true
PG0.GPIO_Mode=GPIO_MODE_AF_PP
PH5.Mode=I2C
PD2.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PH12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D8_DA8.ConfNb=1
PD9.Locked=true
PB8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PJ2.GPIO_Label=DSI_TE
PG14.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PD6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB0.GPIO_PuPd=GPIO_NOPULL
PE1.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PA3.GPIO_Label=LCD_BL_CTRL [STLD40DPUR_EN]
PD6.GPIO_PuPd=GPIO_NOPULL
PA11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PH15.GPIO_Mode=GPIO_MODE_AF_PP
PF15.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D7_DA7.0=FMC_D7,sd-32b-d1
PE15.GPIO_Mode=GPIO_MODE_AF_PP
DSIHOST_D0N.GPIOParameters=GPIO_Label
PD1.GPIO_Mode=GPIO_MODE_AF_PP
PD15.GPIO_Mode=GPIO_MODE_AF_PP
VP_SYS_VS_tim6.Mode=TIM6
SH.FMC_D24.0=FMC_D24,sd-32b-d1
SH.FMC_A4.ConfNb=1
PH12.Signal=FMC_D20
PH12.Locked=true
FMC.RCDDelay1=2
PI3.GPIO_Mode=GPIO_MODE_AF_PP
PG2.GPIO_PuPd=GPIO_NOPULL
PC12.Locked=true
PG4.Signal=FMC_A14_BA0
PG4.Locked=true
RCC.PLLCLKFreq_Value=180000000
PC12.Signal=SDIO_CK
PA14.GPIO_Label=SWCLK
PG6.GPIO_Label=LED1 [Green]
PE8.GPIO_PuPd=GPIO_NOPULL
FMC.LoadToActiveDelay1=2
DSIHOST_D1P.Mode=DSIHost_Video
PA3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PI6.GPIO_Label=D28
PB6.GPIO_Label=QSPI_BK1_NCS [N25Q128A13EF840F_S]
PD4.Locked=true
PA3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.SAIAFreq_Value=108000000
PD6.GPIO_Label=MIC_DATA [MP34DT01TR_DOUT]
PinOutPanel.RotationAngle=0
PB3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PF6.GPIO_Label=QSPI_BK1_IO3 [N25Q128A13EF840F_DQ3]
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
PG15.GPIO_Mode=GPIO_MODE_AF_PP
PH14.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PB11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_A15_BA1.0=FMC_BA1,FourSdramBanks1
PH8.GPIO_Mode=GPIO_MODE_AF_PP
PI0.GPIO_PuPd=GPIO_NOPULL
PH5.Signal=I2C2_SDA
PD15.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PC10.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
RCC.LCDTFTFreq_Value=54000000
PD4.Signal=GPIO_Output
PB2/BOOT1.GPIO_Label=OTG_FS1_PowerSwitchOn [STMPS2151STR_En]
SH.FMC_D10_DA10.ConfNb=1
DSIHOST_CKP.Mode=DSIHost_Video
PH1/OSC_OUT.Signal=RCC_OSC_OUT
SH.FMC_D17.ConfNb=1
PE5.Signal=SAI1_SCK_A
PG0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PJ2.GPIO_Mode=GPIO_MODE_AF_PP
PE10.Locked=true
PF10.GPIO_Label=QSPI_CLK [N25Q128A13EF840F_C]
PH10.GPIO_Label=D18
PD1.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.GPXTI7.0=GPIO_EXTI7
PE11.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PH0/OSC_IN.Locked=true
PG1.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
MxDb.Version=DB.5.0.60
PB0.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE15.Locked=true
PE0.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PG6.GPIO_PuPd=GPIO_NOPULL
SH.FMC_D26.0=FMC_D26,sd-32b-d1
PH11.GPIO_Mode=GPIO_MODE_AF_PP
PF11.GPIO_Mode=GPIO_MODE_AF_PP
PI6.Signal=FMC_D28
PI3.Signal=FMC_D27
PH1/OSC_OUT.Locked=true
SH.FMC_D15_DA15.ConfNb=1
SH.S_TIM4_CH2.0=TIM4_CH2
PF13.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PD4.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PE2.Signal=GPIO_Output
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF3.Signal=FMC_A3
SH.FMC_D25.ConfNb=1
PE10.Signal=FMC_D7_DA7
PF1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
VP_TIM1_VS_ClockSourceINT.Mode=Internal
PH13.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
RCC.MCO2PinFreq_Value=180000000
PC8.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PB2/BOOT1.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PH10.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF8.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
DSIHOST.LPVerticalFrontPorchEnable=DSI_LP_VFP_ENABLE
PJ5.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PI7.GPIO_PuPd=GPIO_NOPULL
PE10.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PA14.Locked=true
PD5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
DSIHOST_D1N.GPIO_Label=DSI_D1_N
PF3.GPIO_PuPd=GPIO_NOPULL
PB8.GPIO_PuPdOD=GPIO_PULLUP
SH.FMC_A1.0=FMC_A1,12b-sda1
PH2.Signal=FMC_SDCKE0
PI7.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_SDCLK.0=FMC_SDCLK,12b-sda1
PF14.Signal=FMC_A8
PI4.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
VP_DMA2D_VS_DMA2D.Mode=DMA2D_Activate
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PG9.GPIO_Mode=GPIO_MODE_AF_PP
PF6.GPIO_Mode=GPIO_MODE_AF_PP
PH8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PB10.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PC12.GPIO_PuPd=GPIO_NOPULL
PB11.GPIO_Mode=GPIO_MODE_AF_PP
PA12.GPIO_PuPd=GPIO_NOPULL
PE10.GPIO_Label=D7
PD9.GPIO_PuPd=GPIO_NOPULL
SH.FMC_D3_DA3.0=FMC_D3,sd-32b-d1
ProjectManager.CustomerFirmwarePackage=
PF4.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PG6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE12.GPIO_PuPd=GPIO_NOPULL
PI10.GPIO_Label=D31
PD8.GPIO_Mode=GPIO_MODE_AF_PP
PB7.GPIO_PuPd=GPIO_NOPULL
PH12.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PA0/WKUP.GPIOParameters=GPIO_Label
SH.FMC_A7.ConfNb=1
PH15.Signal=FMC_D23
SH.FMC_A1.ConfNb=1
PA3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
SH.FMC_D28.0=FMC_D28,sd-32b-d1
PD9.GPIO_Label=D14
PD2.GPIO_PuPd=GPIO_NOPULL
PG9.GPIO_PuPd=GPIO_NOPULL
PG9.Locked=true
PG9.Signal=USART6_RX
PA9.GPIO_Label=VBUS_FS1
PD9.GPIO_Mode=GPIO_MODE_AF_PP
PB11.GPIO_Label=STLK_TX [STLINK V2-1_U2_TX]
PD13.GPIOParameters=GPIO_ModeDefaultPP,GPIO_Speed,GPIO_PuPd,GPIO_Label
PD1.Signal=FMC_D3_DA3
PA11.GPIO_Label=USB_FS1_N
PE1.GPIO_PuPd=GPIO_NOPULL
PF14.GPIO_Label=A8
PD1.GPIO_PuPd=GPIO_NOPULL
PC0.Signal=FMC_SDNWE
RCC.APB1CLKDivider=RCC_HCLK_DIV4
PG1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC11.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF13.GPIO_Label=A7
PF11.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
DSIHOST_CKP.Locked=true
PD10.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_A3.0=FMC_A3,12b-sda1
PA11.Locked=true
FMC.CASLatency1=FMC_SDRAM_CAS_LATENCY_3
SH.FMC_D31.ConfNb=1
PF2.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D15_DA15.0=FMC_D15,sd-32b-d1
PI3.GPIO_PuPd=GPIO_NOPULL
PA9.Signal=USB_OTG_FS_VBUS
PI1.Locked=true
PE9.GPIO_Label=D6
SH.FMC_D17.0=FMC_D17,sd-32b-d1
PA0/WKUP.Mode=SYS_WakeUp0
PB10.Signal=USART3_TX
RCC.USBCLockSelection=RCC_CLK48CLKSOURCE_PLLSAIP
PH9.GPIO_Label=D17
PI9.GPIO_Label=D30
ProjectManager.LastFirmware=true
Mcu.Pin116=VP_TIM1_VS_ClockSourceINT
PI2.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF2.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PI0.GPIO_Mode=GPIO_MODE_AF_PP
PI6.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PI6.Locked=true
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
SH.FMC_D20.ConfNb=1
VP_DMA2D_VS_DMA2D.Signal=DMA2D_VS_DMA2D
PE15.Signal=FMC_D12_DA12
PE8.Signal=FMC_D5_DA5
PI1.Signal=FMC_D25
PC11.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.Pin112=PB11
Mcu.Pin113=VP_DMA2D_VS_DMA2D
Mcu.Pin114=VP_LTDC_DSIMode
RCC.EthernetFreq_Value=180000000
DSIHOST_D1P.Locked=true
PF12.Locked=true
PF11.Locked=true
Mcu.Pin115=VP_SYS_VS_tim6
PA0/WKUP.GPIO_Label=WAKEUP [B2]
Mcu.Pin110=PE15
Mcu.Pin111=PE13
PA9.Locked=true
PB3.GPIO_Mode=GPIO_MODE_AF_PP
PI0.Locked=true
PE7.Locked=true
SH.FMC_SDNCAS.0=FMC_SDNCAS,12b-sda1
PA13.Mode=Serial_Wire
PG14.GPIO_Label=ARDUINO USART6_TX
ProjectManager.FreePins=false
SH.FMC_NBL1.ConfNb=1
PF14.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
RCC.RTCHSEDivFreq_Value=4000000
PH4.Mode=I2C
ProjectManager.UnderRoot=false
PE4.GPIO_PuPd=GPIO_NOPULL
PE13.Locked=true
PF7.GPIO_PuPd=GPIO_NOPULL
PC12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PH14.GPIO_Label=D22
SH.FMC_D7_DA7.ConfNb=1
PC8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC12.GPIO_Mode=GPIO_MODE_AF_PP
PG15.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PE13.GPIO_Label=D10
PE3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
SH.FMC_A10.ConfNb=1
ProjectManager.CompilerOptimize=6
SH.FMC_A5.0=FMC_A5,12b-sda1
PA11.Signal=USB_OTG_FS_DM
PK3.GPIO_Label=LED4 [Blue]
PH5.Locked=true
PF8.Locked=true
PE12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
ProjectManager.ComputerToolchain=false
PF9.Signal=QUADSPI_BK1_IO1
PB8.Mode=I2C
PF6.GPIO_PuPd=GPIO_NOPULL
PG8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin109=PE12
PE2.Locked=true
PF12.GPIO_PuPd=GPIO_NOPULL
PF3.Locked=true
Mcu.Pin105=PA3
Mcu.Pin106=PB0
PI4.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin107=PE7
PD5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
Mcu.Pin108=PE10
PE12.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_NBL3.0=FMC_NBL3,Sd4ByteEnable1
PB6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D12_DA12.ConfNb=1
PD1.Locked=true
PB0.Signal=GPIO_Output
SH.FMC_D19.0=FMC_D19,sd-32b-d1
PE0.GPIO_Mode=GPIO_MODE_AF_PP
PC0.Locked=true
PG15.GPIO_PuPd=GPIO_NOPULL
PD2.GPIO_Label=uSD_CMD
PF3.GPIO_Mode=GPIO_MODE_AF_PP
PG7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PH2.GPIO_Label=SDCKE0 [MT48LC4M32B2B5-6A_CKE]
Mcu.Pin101=PE14
Mcu.Pin102=PB10
Mcu.Pin103=PH8
Mcu.Pin104=PH10
PF6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF2.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin100=PE11
SH.S_TIM4_CH2.ConfNb=1
PE7.GPIO_PuPd=GPIO_NOPULL
RCC.CortexFreq_Value=180000000
SH.FMC_A2.ConfNb=1
PG6.Signal=GPIO_Output
PH14.Locked=true
PI10.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.UserName=STM32F469NIHx
PB10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB6.GPIO_Mode=GPIO_MODE_AF_PP
PD9.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
DSIHOST_D1P.GPIOParameters=GPIO_Label
PF4.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC10.Locked=true
PG6.Locked=true
PC10.Signal=SDIO_D2
PF4.GPIO_PuPd=GPIO_NOPULL
SH.FMC_NBL0.0=FMC_NBL0,Sd4ByteEnable1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_DMA2D_Init-DMA2D-false-HAL-true,4-MX_FMC_Init-FMC-false-HAL-true,5-MX_LTDC_Init-LTDC-false-HAL-true,6-MX_TIM1_Init-TIM1-false-HAL-true,7-MX_DSIHOST_DSI_Init-DSIHOST-false-HAL-true,8-MX_I2C1_Init-I2C1-false-HAL-true,9-MX_I2C2_Init-I2C2-false-HAL-true
PC0.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PI4.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC0.GPIO_Label=SDNWE [MT48LC4M32B2B5-6A_WE]
SH.FMC_D6_DA6.0=FMC_D6,sd-32b-d1
PC9.Locked=true
PA0/WKUP.Signal=SYS_WKUP
PB0.GPIO_Label=EXT_RESET
RCC.PLLI2SRCLKFreq_Value=96000000
PA11.GPIO_PuPd=GPIO_NOPULL
PH5.GPIO_Label=I2C2_SDA [CS43L22_SDA]
PI5.GPIO_Label=FMC_NBL3 [MT48LC4M32B2B5-6A_DQM3]
PE14.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PB11.GPIO_PuPd=GPIO_PULLUP
PB11.Signal=USART3_RX
PI0.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PG8.GPIO_Mode=GPIO_MODE_AF_PP
PE5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
ProjectManager.StackSize=0x400
PH2.GPIO_PuPd=GPIO_NOPULL
PH3.Mode=SdramChipSelect1_1
PA12.Locked=true
SH.FMC_A7.0=FMC_A7,12b-sda1
PA12.Signal=USB_OTG_FS_DP
PH4.GPIOParameters=GPIO_Speed,GPIO_PuPdOD,GPIO_Label,GPIO_Mode
Mcu.UserConstants=
PE5.GPIO_PuPd=GPIO_NOPULL
PH7.Locked=true
PI1.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF5.Locked=true
Mcu.ThirdPartyNb=0
DSIHOST.LPVerticalActiveEnable=DSI_LP_VACT_ENABLE
PE1.GPIO_Mode=GPIO_MODE_AF_PP
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=180000000
Mcu.IPNb=10
PH5.GPIO_Mode=GPIO_MODE_AF_OD
PF11.GPIO_Label=SDNMT48LC4M32B2B5-6A_RAS]RAS [
PA0/WKUP.Locked=true
PF2.GPIO_PuPd=GPIO_NOPULL
PD8.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF12.Signal=FMC_A6
Mcu.Pin6=PB8
PH15.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin7=PB3
Mcu.Pin8=PC12
Mcu.Pin9=PA14
RCC.VCOSAIOutputFreq_Value=216000000
PC9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PJ2.Locked=true
SH.FMC_A10.0=FMC_A10,12b-sda1
RCC.AHBFreq_Value=180000000
Mcu.Pin0=PE4
Mcu.Pin1=PE3
Mcu.Pin2=PE2
DSIHOST_D1N.Mode=DSIHost_Video
Mcu.Pin3=PG14
PK3.Locked=true
Mcu.Pin4=PE1
PD10.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin5=PE0
SH.FMC_D8_DA8.0=FMC_D8,sd-32b-d1
FMC.RPDelay1=2
PJ5.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_RISING
SH.FMC_D2_DA2.0=FMC_D2,sd-32b-d1
PE13.Signal=FMC_D10_DA10
PF7.GPIO_Label=QSPI_BK1_IO2 [N25Q128A13EF840F_DQ2]
PI1.GPIO_PuPd=GPIO_NOPULL
PI5.Locked=true
PE0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PI5.Signal=FMC_NBL3
PE4.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PI0.Signal=FMC_D24
File.Version=6
PA10.GPIO_Label=USB_FS1_ID
PB3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.FMC_D5_DA5.ConfNb=1
PH3.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_D2_DA2.ConfNb=1
PB8.Locked=true
SH.FMC_SDNRAS.0=FMC_SDNRAS,12b-sda1
LTDC.ActiveW=800
PE4.Signal=SAI1_FS_A
PH1/OSC_OUT.Mode=HSE-External-Oscillator
PF12.GPIO_Mode=GPIO_MODE_AF_PP
ProjectManager.ProjectName=st-f469i-disco-cube
DSIHOST_D1N.GPIOParameters=GPIO_Label
SH.FMC_D0_DA0.0=FMC_D0,sd-32b-d1
PC14/OSC32_IN.Signal=RCC_OSC32_IN
PH9.GPIO_PuPd=GPIO_NOPULL
PD14.Locked=true
PD15.GPIO_PuPd=GPIO_NOPULL
PF15.GPIO_PuPd=GPIO_NOPULL
PF5.GPIO_Label=A5
SH.GPXTI5.ConfNb=1
PF3.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_A9.0=FMC_A9,12b-sda1
DSIHOST_D0N.Locked=true
SH.FMC_D4_DA4.0=FMC_D4,sd-32b-d1
PE8.GPIO_Mode=GPIO_MODE_AF_PP
PE0.GPIO_Label=FMC_NBL0 [ MT48LC4M32B2B5-6A_DQM0]
RCC.PLLSAIN=216
PH3.GPIO_Label=SDNE0 [MT48LC4M32B2B5-6A_CS]
PF5.Signal=FMC_A5
RCC.PLLSAIP=RCC_PLLSAIP_DIV6
PB2/BOOT1.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PH7.Signal=GPIO_Output
RCC.PLLSAIQ=2
PB9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE13.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D19.ConfNb=1
SH.FMC_D30.0=FMC_D30,sd-32b-d1
PF0.Signal=FMC_A0
PI2.GPIO_Label=D26
PC0.GPIO_PuPd=GPIO_NOPULL
SH.FMC_NBL0.ConfNb=1
RCC.SAIBFreq_Value=108000000
PF0.GPIO_Mode=GPIO_MODE_AF_PP
PB3.Locked=true
PH14.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PB3.GPIO_Label=I2S3_CK
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
SH.GPXTI5.0=GPIO_EXTI5
PE8.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_A9.ConfNb=1
PH2.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PH15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PB9.GPIO_Label=I2C1_SDA
PC10.GPIO_Label=uSD_D2
PH11.Signal=FMC_D19
ProjectManager.NoMain=false
PG1.Signal=FMC_A11
PG1.Locked=true
RCC.PLLRFreq_Value=180000000
PH5.GPIO_PuPdOD=GPIO_PULLUP
SH.FMC_SDCLK.ConfNb=1
PE5.GPIO_Mode=GPIO_MODE_AF_PP
PI10.Signal=FMC_D31
PD5.Signal=GPIO_Output
PA10.GPIO_Mode=GPIO_MODE_AF_PP
PE9.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
RCC.DSITXEscFreq_Value=15625000
PH13.GPIO_Label=D21
PC8.GPIO_Label=uSD_D0
PC12.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PD10.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D21.0=FMC_D21,sd-32b-d1
PH8.GPIO_Label=D16
PE4.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_NBL3.ConfNb=1
PD15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PE15.GPIO_Label=D12
PH4.Signal=I2C2_SCL
ProjectManager.TargetToolchain=Makefile
PE7.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_D1_DA1.ConfNb=1
PF15.Locked=true
PE4.Locked=true
PC11.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF2.Signal=FMC_A2
PH8.GPIO_PuPd=GPIO_NOPULL
PF5.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PH2.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PH11.Locked=true
SH.FMC_D28.ConfNb=1
DSIHOST_D0P.GPIOParameters=GPIO_Label
PE11.Signal=FMC_D8_DA8
PE7.GPIO_Mode=GPIO_MODE_AF_PP
PI10.GPIO_Mode=GPIO_MODE_AF_PP
PG9.GPIO_Label=USART6_RX
PG14.Signal=USART6_TX
PI5.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PK3.GPIO_PuPd=GPIO_NOPULL
PG1.GPIO_Label=A11
PB9.GPIO_Mode=GPIO_MODE_AF_OD
DSIHOST.NumberOfLanes=DSI_TWO_DATA_LANES
PA12.GPIO_Mode=GPIO_MODE_AF_PP
PH0/OSC_IN.Signal=RCC_OSC_IN
PG7.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.APB2Freq_Value=90000000
PH2.GPIO_Mode=GPIO_MODE_AF_PP
PC0.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D13_DA13.ConfNb=1
LTDC.Layers=0
PI3.Locked=true
PD4.GPIO_Label=LED2 [Orange]
PF10.Signal=QUADSPI_CLK
PH3.GPIO_Mode=GPIO_MODE_AF_PP
PF1.GPIO_PuPd=GPIO_NOPULL
PI7.GPIO_Label=D29
PD13.GPIO_PuPd=GPIO_NOPULL
PE1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF15.Signal=FMC_A9
PD14.GPIO_Label=D0
PF0.Locked=true
PE11.Locked=true
Mcu.Name=STM32F469NIHx
SH.FMC_D23.ConfNb=1
PA13.GPIO_Label=SWDIO
DSIHOST_CKN.Mode=DSIHost_Video
DSIHOST_D0N.GPIO_Label=DSI_D0_N
PD14.Signal=FMC_D0_DA0
PH9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PB3.Signal=I2S3_CK
PH4.GPIO_Mode=GPIO_MODE_AF_OD
PF0.GPIO_PuPd=GPIO_NOPULL
PC15/OSC32_OUT.Mode=LSE-External-Oscillator
SH.FMC_D23.0=FMC_D23,sd-32b-d1
PF12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PA14.Signal=SYS_JTCK-SWCLK
DSIHOST_D0N.Signal=DSIHOST_D0N
PF6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PB9.GPIO_PuPdOD=GPIO_PULLUP
VP_LTDC_DSIMode.Mode=RGB888
PH2.Locked=true
PK3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PF8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB8.Signal=I2C1_SCL
PE3.GPIO_Label=SPKR/HP [CS43L22_SPKR/HP]
PF14.GPIO_Mode=GPIO_MODE_AF_PP
PC9.Signal=SDIO_D1
PA11.GPIO_Mode=GPIO_MODE_AF_PP
PB8.GPIO_Mode=GPIO_MODE_AF_OD
RCC.APB1Freq_Value=45000000
PB11.Locked=true
ProjectManager.DeviceId=STM32F469NIHx
ProjectManager.LibraryCopy=1
PE9.GPIO_PuPd=GPIO_NOPULL
PF2.GPIO_Label=A2
